Обработки/Reports/_ОтчетПоДеятельностиОПС0420254_0420255.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоДеятельностиОПС0420254_0420255</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Comment>0 - тыс. руб., 1 - руб.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформироватьРазделДоходностиПоУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартМСФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтандартыФинансовойОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиРасшифровкуСредневзвешенныхВложений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиКолонкиДляФормы264</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоДеятельностиОПС0420254_0420255/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	Отчет.Организация    = ПараметрыСеанса.ТекущаяОрганизация;
	Отчет.Период.Вариант = ВариантСтандартногоПериода.ПрошлыйМесяц;
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область Команды_Формы

&НаСервере
Процедура СформироватьНаСервере(АдресВХранилище = "", АдресВХранилищеСДаннымиДляРасшифровки = "")
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ТабДокумент = Новый ТабличныйДокумент;
		
	ОтчетОбъект.СформироватьОтчет(Результат, АдресВХранилище, АдресВХранилищеСДаннымиДляРасшифровки);	
	
	Если АдресВХранилищеСДаннымиДляРасшифровки <> "" Тогда
		АдресВХранилищеСДаннымиДляРасшифровки = ПоместитьВоВременноеХранилище(ПолучитьИзВременногоХранилища(АдресВХранилищеСДаннымиДляРасшифровки), ЭтаФорма.УникальныйИдентификатор);	
		Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АдресВХранилищеСДаннымиДляРасшифровки", АдресВХранилищеСДаннымиДляРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период");
		Возврат;
	КонецЕсли;
	
	Если Отчет.Период.ДатаНачала <> НачалоГода(Отчет.Период.ДатаНачала) Тогда
		// Отчет по умолчанию формируется с начала года, поэтому спрашиваем
		Если Вопрос("Отчет должен формироваться с начала года, выбрана дата начала периода " + Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + ". Продолжить формирование с этой даты?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	АдресВХранилище 							= "";	
	АдресРезультатовЗапросовДляРасшифровки 		= "";
		
	СформироватьНаСервере(АдресВХранилище, АдресРезультатовЗапросовДляРасшифровки);
			
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НЕИСПОЛЬЗОВАТЬ");
	
	Если Отчет.ВывестиРасшифровкуСредневзвешенныхВложений Тогда
		
		Расшифровка = РасшифроватьВсеСредневзвешенныеВложенияНаСервере(АдресВХранилище);

		Если Расшифровка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИмяФормыРасшифровки = Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".", НаправлениеПоиска.СКонца)) + "ФормаРасшифровки";
		
		ФормаРасшифровки = ПолучитьФорму(ИмяФормыРасшифровки, , ЭтаФорма);  
		ФормаРасшифровки.Расшифровка = Расшифровка;
		
		Если ФормаРасшифровки.Открыта() Тогда
			ФормаРасшифровки.Активизировать();		
		Иначе
			ФормаРасшифровки.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Формы

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
		
	ПриИзмененииПараметровШапки();	
	ОбновитьРеквизитыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();	
	ОбновитьРеквизитыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();	
	ОбновитьРеквизитыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораДоверительногоУправленияПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();	
	ОбновитьРеквизитыНаСервере();
	
КонецПроцедуры                      

&НаКлиенте
Процедура ФорматВыводаПриИзменении(Элемент)

	ПриИзмененииПараметровШапки();	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбор(Элемент, Область, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ВариантФормы = РаботаСОтчетамиКлиентСервер.ПолучитьКлючВариантаОтчета(Отчет);	
	
	Если Элемент.ОтображениеСостояния.ДополнительныйРежимОтображения <> ДополнительныйРежимОтображения.НеИспользовать
		ИЛИ Не ЗначениеЗаполнено(ВариантФормы)
		ИЛИ ТипЗнч(Элемент.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента")
	Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЯчейки = Элемент.ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(ДанныеЯчейки) = Тип("Структура") Тогда
		ПолеРасшифровки = ДанныеЯчейки.ИмяПоля;
	Иначе
		ПолеРасшифровки = ДанныеЯчейки;
	КонецЕсли;		
	
	Если ПустаяСтрока(ПолеРасшифровки) Тогда
		Возврат;	
	КонецЕсли;
	
	Расшифровка = СформироватьРасшифровкуНаСервере(ПолеРасшифровки, ДанныеЯчейки, ВариантФормы);
	Если Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормыРасшифровки = Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".", НаправлениеПоиска.СКонца)) + "ФормаРасшифровки";
	
	ФормаРасшифровки = ПолучитьФорму(ИмяФормыРасшифровки, , ЭтаФорма);  
	ФормаРасшифровки.Расшифровка = Расшифровка;
	
	Если ФормаРасшифровки.Открыта() Тогда
		ФормаРасшифровки.Активизировать();		
	Иначе
		ФормаРасшифровки.Открыть();
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРазделДоходностиПоУКПриИзменении(Элемент)
	
	ПриИзмененииПараметровШапки();	
	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область Прочие_процедуры_и_Функции

&НаКлиенте
Процедура ПриИзмененииПараметровШапки()
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НЕАКТУАЛЬНОСТЬ");
	
КонецПроцедуры

&НаСервере
Функция СформироватьРасшифровкуНаСервере(ПолеРасшифровки, ДополнительныеДанные, ВариантФормы)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");		
	
	ПоляРасшифровкиДоходности = Новый Массив;
	ПоляРасшифровкиДоходности.Добавить("СредневзвешенныеВложения");
	ПоляРасшифровкиДоходности.Добавить("ДоходыОтПродажи");
	ПоляРасшифровкиДоходности.Добавить("ПроцентныеДоходы");
	ПоляРасшифровкиДоходности.Добавить("ДоходыОтПереоценки");
	ПоляРасшифровкиДоходности.Добавить("ДоходыПрочие");
	ПоляРасшифровкиДоходности.Добавить("ДоходыВсего");
	
	Запрос = Новый Запрос;
	
	ЭтоПолеРасшифровкиДоходности = ПоляРасшифровкиДоходности.Найти(ПолеРасшифровки) <> Неопределено;
	
	Если ЭтоПолеРасшифровкиДоходности Тогда
		
		СоответствиеРезультатовЗапросов	= ПолучитьИзВременногоХранилища(Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.АдресВХранилищеСДаннымиДляРасшифровки);		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		ПоместитьДанныеДляРасшифровкиВЗапрос(Запрос, СоответствиеРезультатовЗапросов);
	
	КонецЕсли;  
	
	ВыборкаРасшифровки = ОтчетОбъект.ПолучитьВыборкуРасшифровкиЯчейки(ПолеРасшифровки, 
									ДополнительныеДанные, 
									ВариантФормы,
									?(ЭтоПолеРасшифровкиДоходности, Запрос.МенеджерВременныхТаблиц, Неопределено));
									
	Если ВыборкаРасшифровки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ТабДокумент = Новый ТабличныйДокумент;
	
	Если ПолеРасшифровки = "СредневзвешенныеВложения" Тогда
		
		Макет = ОтчетОбъект.ПолучитьМакет("РасшифровкаСредневзвешенныхВложений");	
		
		ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДокумент.Вывести(ОбластьШапка);
		СредневзвешенныеВложенияИтого 	= 0;
		ПотокИтого 						= 0;
		
		Если ВыборкаРасшифровки.Следующий() Тогда // Строка итогов
			СредневзвешенныеВложенияИтого 	= ВыборкаРасшифровки.СредневзвешенныеВложения; 		
			ПотокИтого 						= ВыборкаРасшифровки.Поток; 		
		КонецЕсли;

		Пока ВыборкаРасшифровки.Следующий() Цикл			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаРасшифровки);
			ТабДокумент.Вывести(ОбластьСтрока);			
		КонецЦикла;
		
		ОбластьПодвал.Параметры.СредневзвешенныеВложения = СредневзвешенныеВложенияИтого;	
		ОбластьПодвал.Параметры.Поток = ПотокИтого;	
		ОбластьПодвал.Параметры.ФинансовыйРезультат = ДополнительныеДанные.ФинансовыйРезультат;	

		ТабДокумент.Вывести(ОбластьПодвал);
		
	ИначеЕсли ЭтоПолеРасшифровкиДоходности Тогда
		
		Макет = ОтчетОбъект.ПолучитьМакет("РасшифровкаФинансовогоРезультата");	
		
		ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДокумент.Вывести(ОбластьШапка);
		
		СуммаИтого = 0;
		Если ВыборкаРасшифровки.Следующий() Тогда // Строка итогов
			СуммаИтого 	= ВыборкаРасшифровки.Сумма; 		
		КонецЕсли;

		Пока ВыборкаРасшифровки.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаРасшифровки);
			
			Если ВыборкаРасшифровки.РазделОтчета = "ДоходыОтПродажи" Тогда
				ОбластьСтрока.Параметры.РазделОтчета = "от продажи, погашения активов";
			ИначеЕсли ВыборкаРасшифровки.РазделОтчета = "ДоходыОтПереоценки" Тогда
				ОбластьСтрока.Параметры.РазделОтчета = "от переоценки";
			ИначеЕсли ВыборкаРасшифровки.РазделОтчета = "ПроцентныеДоходы" Тогда
				ОбластьСтрока.Параметры.РазделОтчета = "% доходы, дивиденды";
			ИначеЕсли ВыборкаРасшифровки.РазделОтчета = "ДоходыПрочие" Тогда
				ОбластьСтрока.Параметры.РазделОтчета = "прочие";
			КонецЕсли; 
				
			ТабДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Сумма = СуммаИтого;	
		ТабДокумент.Вывести(ОбластьПодвал);
		
	Иначе	
	
		Макет = ОтчетОбъект.ПолучитьМакет("РасшифровкаЯчейки");
		
		Если Отчет.ФорматВывода = 1 Тогда
			Макет.Область("ОбластьРесурсы").Формат = "ЧДЦ=2";
		ИначеЕсли Отчет.ФорматВывода = 0 Тогда
			Макет.Область("ОбластьРесурсы").Формат = "ЧДЦ=5; ЧС=3";
		КонецЕсли;
		
		ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьШапкаНачало 			= Макет.ПолучитьОбласть("Шапка|Начало");
		ОбластьШапкаСумма 			= Макет.ПолучитьОбласть("Шапка|Сумма");
		
		ОбластьСтрокаНачало 		= Макет.ПолучитьОбласть("Строка|Начало");
		ОбластьСтрокаСумма 			= Макет.ПолучитьОбласть("Строка|Сумма");
		
		ОбластьПодвалНачало 		= Макет.ПолучитьОбласть("Подвал|Начало");
		ОбластьПодвалСумма 			= Макет.ПолучитьОбласть("Подвал|Сумма");
		
		ЕстьЦБ = СтрНачинаетсяС(ПолеРасшифровки, "ОборотыПоСделкам");	
		
		Если ЕстьЦБ Тогда
			ТабДокумент.Вывести(ОбластьШапка);
		Иначе	
			ТабДокумент.Вывести(ОбластьШапкаНачало);
			ТабДокумент.Присоединить(ОбластьШапкаСумма);
		КонецЕсли;
		
		СуммаИтого = 0;
		Если ВыборкаРасшифровки.Следующий() Тогда // Строка итогов
			СуммаИтого = ВыборкаРасшифровки.Сумма; 		
		КонецЕсли;
		
		Пока ВыборкаРасшифровки.Следующий() Цикл
			Если ЕстьЦБ Тогда
				ОбластьСтрока.Параметры.Заполнить(ВыборкаРасшифровки);
				ТабДокумент.Вывести(ОбластьСтрока);
			Иначе
				ОбластьСтрокаНачало.Параметры.Заполнить(ВыборкаРасшифровки);
				ТабДокумент.Вывести(ОбластьСтрокаНачало);
				ОбластьСтрокаСумма.Параметры.Заполнить(ВыборкаРасшифровки);
				ТабДокумент.Присоединить(ОбластьСтрокаСумма);
			КонецЕсли;	
		КонецЦикла;
		
		Если ЕстьЦБ Тогда
			ОбластьПодвал.Параметры.Сумма = СуммаИтого;	
			ТабДокумент.Вывести(ОбластьПодвал);
		Иначе
			ТабДокумент.Вывести(ОбластьПодвалНачало);
			ОбластьПодвалСумма.Параметры.Сумма = СуммаИтого;	
			ТабДокумент.Присоединить(ОбластьПодвалСумма);	
		КонецЕсли;
		
	КонецЕсли;
	
	ТабДокумент.ТолькоПросмотр = Истина;	
	                  
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Функция РасшифроватьВсеСредневзвешенныеВложенияНаСервере(АдресВХранилище)
	
	Если АдресВХранилище = "" Тогда
		Возврат Неопределено
	КонецЕсли;
	
	МассивАктивовДляРасшифровки 	= ПолучитьИзВременногоХранилища(АдресВХранилище);
	СоответствиеРезультатовЗапроса	= ПолучитьИзВременногоХранилища(Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.АдресВХранилищеСДаннымиДляРасшифровки);
	
	УдалитьИзВременногоХранилища(АдресВХранилище);
	
	Если МассивАктивовДляРасшифровки.Количество() = 0 Тогда		
		Возврат Неопределено;
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьДанныеДляРасшифровкиВЗапрос(Запрос, СоответствиеРезультатовЗапроса);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");		
		
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ОтчетОбъект.ПолучитьМакет("РасшифровкаСредневзвешенныхВложений");	
	ОбластьШапка  		= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 		= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	ОбластьРазделитель	= Макет.ПолучитьОбласть("Разделитель");
	ТабДокумент.Вывести(ОбластьШапка);
	
	Для Каждого ДополнительныеДанные Из МассивАктивовДляРасшифровки Цикл
		 		
		ВыборкаРасшифровки = ОтчетОбъект.ПолучитьВыборкуРасшифровкиЯчейки("СредневзвешенныеВложения", ДополнительныеДанные, , Запрос.МенеджерВременныхТаблиц);
		Если ВыборкаРасшифровки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
	    		
		СредневзвешенныеВложенияИтого 	= 0;
		ПотокИтого 						= 0;
		
		Если ВыборкаРасшифровки.Следующий() Тогда // Строка итогов			
			СредневзвешенныеВложенияИтого 	= ВыборкаРасшифровки.СредневзвешенныеВложения; 		
			ПотокИтого 						= ВыборкаРасшифровки.Поток; 		
		Иначе
			// Ничего нет, пропускаем
			Продолжить;
		КонецЕсли;

		ОбластьСтрока.Параметры.КлассАктива 				= "";
		ОбластьСтрока.Параметры.ИдентификаторАктива 		= "";
		ОбластьСтрока.Параметры.Дата 						= "";
		ОбластьСтрока.Параметры.Действие 					= "";
		ОбластьСтрока.Параметры.СправедливаяСтоимость 		= 0;
		ОбластьСтрока.Параметры.Количество 					= 0;
		ОбластьСтрока.Параметры.ДнейВРаботе 				= 0;
		ОбластьСтрока.Параметры.ДнейВРаботе_Процент 		= 0;
		ОбластьСтрока.Параметры.Поток 						= 0;
		ОбластьСтрока.Параметры.СредневзвешенныеВложения 	= 0;

		Пока ВыборкаРасшифровки.Следующий() Цикл			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаРасшифровки);
			ТабДокумент.Вывести(ОбластьСтрока);			
		КонецЦикла;
		
		ОбластьПодвал.Параметры.СредневзвешенныеВложения 	= СредневзвешенныеВложенияИтого;	
		ОбластьПодвал.Параметры.Поток 						= ПотокИтого;	
		ОбластьПодвал.Параметры.ФинансовыйРезультат 		= ДополнительныеДанные.ФинансовыйРезультат;	
		ТабДокумент.Вывести(ОбластьПодвал);

		ТабДокумент.Вывести(ОбластьРазделитель);
		
	КонецЦикла;	

	ТабДокумент.ТолькоПросмотр = Истина;	
	                  
	Возврат ТабДокумент;

КонецФункции

&НаСервереБезКонтекста
Процедура ПоместитьДанныеДляРасшифровкиВЗапрос(Запрос, СоответствиеРезультатовЗапросов)
	
	Для Каждого ЭлементСоответствия Из СоответствиеРезультатовЗапросов Цикл
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|*
			|ПОМЕСТИТЬ _ИмяТаблицы
			|ИЗ &Таблица КАК ИмяТаблицы";
		
		Запрос.УстановитьПараметр("Таблица", ЭлементСоответствия.Значение.Выгрузить());
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "_ИмяТаблицы", ЭлементСоответствия.Ключ);
		
		Запрос.Выполнить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	ЭтаФорма.Элементы.ГруппаДоходностьПоУК.Видимость 			= Отчет.СформироватьРазделДоходностиПоУК;
	ЭтаФорма.Элементы.Клиент.Видимость 							= Отчет.СформироватьРазделДоходностиПоУК;
	ЭтаФорма.Элементы.СчетДоверительногоУправления.Видимость 	= Не Отчет.СформироватьРазделДоходностиПоУК;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыНаСервере()
	
	Если Не Отчет.СформироватьРазделДоходностиПоУК Тогда	                                           	
		
		Если ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) Тогда		
			Отчет.ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
			Отчет.Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Отчет.СчетДоверительногоУправления, Отчет.Период.ДатаОкончания);
		КонецЕсли;
		
	Иначе
		
		Если Не (ЗначениеЗаполнено(Отчет.Клиент) И ЗначениеЗаполнено(Отчет.ВидДоговораДоверительногоУправления) И Отчет.Период.ДатаНачала <> '00010101' И Отчет.Период.ДатаОкончания <> '00010101') Тогда
			Возврат;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.Клиент, "ВидЮрФизЛица") <> Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбран неверный клиент");
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
				
		Запрос.УстановитьПараметр("НачалоПериода", 							Отчет.Период.ДатаНачала);
		Запрос.УстановитьПараметр("КонецПериода", 							Отчет.Период.ДатаОкончания);	
		Запрос.УстановитьПараметр("Организация", 							Отчет.Организация);
		Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления", 	Отчет.ВидДоговораДоверительногоУправления);
		Запрос.УстановитьПараметр("Клиент",									Отчет.Клиент);		
		
		Запрос.Текст = 
		    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		    |	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		    |	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		    |ИЗ
		    |	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		    |			&КонецПериода,
		    |			Организация = &Организация
		    |				И Клиент = &Клиент
		    |				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &ВидДоговораДоверительногоУправления
		    |				И (СчетДоверительногоУправления.ДатаРасторжения >= &НачалоПериода
		    |					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))) КАК КлиентыДоверительногоУправленияСрезПоследних";

		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			Отчет.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют счета доверительного управлениия по указанным параметрам. Проверьте выбор периода, клиента и вида договора ДУ");
			Возврат;	
		КонецЕсли;
		
		ОбъектОтчета = РеквизитФормыВЗначение("Отчет");
		Отчет.СтандартМСФО = ОбъектОтчета.СтандартМСФОИзНастроек(Отчет.СчетДоверительногоУправления);
				
	КонецЕсли; 	

КонецПроцедуры

#КонецОбласти
